In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['IBM','IBM','ACN','ACN','TCS','TCS'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,250]}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

  Company   Person  Sales
0     IBM      Sam    200
1     IBM  Charlie    120
2     ACN      Amy    340
3     ACN  Vanessa    124
4     TCS     Carl    243
5     TCS    Sarah    250

In [9]:
byCompany=df.groupby('Company')

In [10]:
byCompany

In [12]:
byCompany.mean()

         Sales
Company
ACN      232.0
IBM      160.0
TCS      246.5

In [13]:
byCompany.sum()

         Sales
Company
ACN        464
IBM        320
TCS        493

In [14]:
byCompany.std()

              Sales
Company
ACN      152.735065
IBM       56.568542
TCS        4.949747

In [15]:
byCompany.sum().loc['IBM']

Sales    320
Name: IBM, dtype: int64

In [19]:
df.groupby('Company').sum().loc['ACN']

Sales    464
Name: ACN, dtype: int64

In [20]:
df.groupby('Company').count()

         Person  Sales
Company
ACN           2      2
IBM           2      2
TCS           2      2

In [21]:
df.groupby('Company').max()

          Person  Sales
Company
ACN      Vanessa    340
IBM          Sam    200
TCS        Sarah    250

In [22]:
df.groupby('Company').min()

          Person  Sales
Company
ACN          Amy    124
IBM      Charlie    120
TCS         Carl    243

In [23]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
ACN       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
IBM       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
TCS       2.0  246.5    4.949747  243.0  244.75  246.5  248.25  250.0

In [24]:
df.groupby('Company').describe().transpose()

Company             ACN         IBM         TCS
Sales count    2.000000    2.000000    2.000000
      mean   232.000000  160.000000  246.500000
      std    152.735065   56.568542    4.949747
      min    124.000000  120.000000  243.000000
      25%    178.000000  140.000000  244.750000
      50%    232.000000  160.000000  246.500000
      75%    286.000000  180.000000  248.250000
      max    340.000000  200.000000  250.000000